docs/src/main/tut/examples/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-19 Thu 16:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Examples of xReact Fantasy</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jichao Ouyang" />
</head>
<body>
<div id="content">
<h1 class="title">Examples of xReact Fantasy</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7e0bf25">1. Example 0: How to use xReact Fantasy</a></li>
<li><a href="#org1276076">2. Example 1: Two number multiply</a></li>
<li><a href="#org3b06ba6">3. Example 2: Two Inputs</a></li>
<li><a href="#org45af1d6">4. Example 3: Semigroup</a></li>
<li><a href="#orga75fcd2">5. Example 4: Traverse</a></li>
<li><a href="#org9aada60">6. Example 5: Asynchronous</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7e0bf25" class="outline-2">
<h2 id="org7e0bf25"><span class="section-number-2">1</span> Example 0: How to use xReact Fantasy</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ff79c6; font-weight: bold;">import</span> * as React from <span style="color: #f1fa8c;">'react'</span>;
<span style="color: #ff79c6; font-weight: bold;">import</span> { render } from <span style="color: #f1fa8c;">'react-dom'</span>;
<span style="color: #ff79c6; font-weight: bold;">import</span> <span style="color: #f1fa8c;">'../../../../../src/xs/rx'</span>
<span style="color: #ff79c6; font-weight: bold;">import</span> { Applicative, lift2,Semigroup, Functor, map, Traversable, FlatMap } from <span style="color: #f1fa8c;">'../../../../../src/fantasy'</span>
<span style="color: #ff79c6; font-weight: bold;">import</span> {X} from <span style="color: #f1fa8c;">'../../../../../src'</span>
<span style="color: #ff79c6; font-weight: bold;">function</span> <span style="color: #50fa7b; font-weight: bold;">xmount</span>(<span style="color: #f8f8f2;">component</span>, <span style="color: #f8f8f2;">dom</span>) { render(React.createFactory(X)({}, component), dom) }
</pre>
</div>
</div>
</div>

<div id="outline-container-org1276076" class="outline-2">
<h2 id="org1276076"><span class="section-number-2">2</span> Example 1: Two number multiply</h2>
<div class="outline-text-2" id="text-2">
<p>
A multiply function can be simply lifted to be a function that works with xReact FantasyX
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">mult</span> = (x:number,y: number) =&gt; x * y
<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Xeg1</span> = lift2&lt;<span style="color: #f1fa8c;">"FantasyX"</span>,<span style="color: #f8f8f2;">number</span>, <span style="color: #f8f8f2;">number</span>, <span style="color: #f8f8f2;">number</span>&gt;(mult)(Applicative.FantasyX.pure(6), Applicative.FantasyX.pure(5))
</pre>
</div>

<p>
A very basic Stateless Component to display it.
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">ViewEg1</span> = props =&gt; &lt;p className=<span style="color: #f1fa8c;">"result"</span>&gt;{props.product}&lt;/p&gt;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Eg1</span> = Functor.FantasyX.map(a=&gt;({product: a}), Xeg1).apply(ViewEg1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js">xmount(&lt;Eg1/&gt;, document.getElementById(<span style="color: #f1fa8c;">'eg1'</span>) )
</pre>
</div>

<p><div id="eg1"></div></p>
</div>
</div>


<div id="outline-container-org3b06ba6" class="outline-2">
<h2 id="org3b06ba6"><span class="section-number-2">3</span> Example 2: Two Inputs</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ff79c6; font-weight: bold;">import</span> {Xstream} from <span style="color: #f1fa8c;">'../../../../../src/fantasy/xstream'</span>;

<span style="color: #ff79c6; font-weight: bold;">function</span> <span style="color: #50fa7b; font-weight: bold;">strToInt</span>(<span style="color: #f8f8f2;">x</span>) {<span style="color: #ff79c6; font-weight: bold;">return</span> ~~x}
type Intent = {type:string, value:number}
<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">XSinput1</span> = Xstream.fromEvent(<span style="color: #f1fa8c;">'change'</span>, <span style="color: #f1fa8c;">'n1'</span>, <span style="color: #f1fa8c;">'5'</span>)
<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">XSinput2</span> = Xstream.fromEvent(<span style="color: #f1fa8c;">'change'</span>, <span style="color: #f1fa8c;">'n2'</span>, <span style="color: #f1fa8c;">'6'</span>)

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Xeg2</span> = lift2&lt;<span style="color: #f1fa8c;">"Xstream"</span>, <span style="color: #f8f8f2;">number</span>, <span style="color: #f8f8f2;">number</span>, <span style="color: #f8f8f2;">number</span>&gt;(mult)(
  Functor.Xstream.map(strToInt, XSinput1),
  Functor.Xstream.map(strToInt, XSinput2)
).toFantasyX()
    .map(x=&gt;({product: x}))

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">ViewEg2</span> = props =&gt; &lt;section&gt;
    &lt;p&gt;&lt;input type=<span style="color: #f1fa8c;">"number"</span> name=<span style="color: #f1fa8c;">"n1"</span> onChange={props.actions.fromEvent} defaultValue=<span style="color: #f1fa8c;">"5"</span>/&gt;&lt;/p&gt;
    &lt;p&gt;&lt;input type=<span style="color: #f1fa8c;">"number"</span> name=<span style="color: #f1fa8c;">"n2"</span> onChange={props.actions.fromEvent} defaultValue=<span style="color: #f1fa8c;">"6"</span>/&gt;&lt;/p&gt;
    &lt;p&gt;&lt;span className=<span style="color: #f1fa8c;">"result"</span>&gt;{props.product}&lt;/span&gt;&lt;/p&gt;
    &lt;/section&gt;

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Eg2</span> = Xeg2.apply(ViewEg2)
</pre>
</div>

<p><div id="eg2"></div></p>
</div>
</div>

<div id="outline-container-org45af1d6" class="outline-2">
<h2 id="org45af1d6"><span class="section-number-2">4</span> Example 3: Semigroup</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Xeg3</span> = Semigroup.Xstream.concat(
  Semigroup.Xstream.concat(
    Xstream.fromEvent(<span style="color: #f1fa8c;">'change'</span>, <span style="color: #f1fa8c;">'firstName'</span>, <span style="color: #f1fa8c;">'Jichao'</span>),
    Applicative.Xstream.pure(<span style="color: #f1fa8c;">' '</span>)
  ),
  Xstream.fromEvent(<span style="color: #f1fa8c;">'change'</span>, <span style="color: #f1fa8c;">'lastName'</span>, <span style="color: #f1fa8c;">'Ouyang'</span>)
).toFantasyX()
<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">ViewEg3</span> = props =&gt; &lt;section&gt;
    &lt;p&gt;&lt;input type=<span style="color: #f1fa8c;">"text"</span> name=<span style="color: #f1fa8c;">"firstName"</span> onChange={props.actions.fromEvent} defaultValue=<span style="color: #f1fa8c;">"Jichao"</span> /&gt;&lt;/p&gt;
    &lt;p&gt;&lt;input type=<span style="color: #f1fa8c;">"text"</span> name=<span style="color: #f1fa8c;">"lastName"</span> onChange={props.actions.fromEvent} defaultValue=<span style="color: #f1fa8c;">"Ouyang"</span>/&gt;&lt;/p&gt;
    &lt;p&gt;&lt;span className=<span style="color: #f1fa8c;">"result"</span>&gt;{props.semigroup}&lt;/span&gt;&lt;/p&gt;
    &lt;/section&gt;

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Eg3</span> = Xeg3.map(a=&gt;({semigroup: a})).apply(ViewEg3)
</pre>
</div>

<p><div id="eg3"></div></p>
</div>
</div>

<div id="outline-container-orga75fcd2" class="outline-2">
<h2 id="orga75fcd2"><span class="section-number-2">5</span> Example 4: Traverse</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ff79c6; font-weight: bold;">function</span> <span style="color: #50fa7b; font-weight: bold;">sum</span>(<span style="color: #f8f8f2;">list</span>){
  <span style="color: #ff79c6; font-weight: bold;">return</span> list.reduce((acc,x)=&gt; acc+x, 0)
}
<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">list</span> = [<span style="color: #f1fa8c;">'1'</span>, <span style="color: #f1fa8c;">'2'</span>, <span style="color: #f1fa8c;">'3'</span>, <span style="color: #f1fa8c;">'4'</span>, <span style="color: #f1fa8c;">'5'</span>, <span style="color: #f1fa8c;">'6'</span>, <span style="color: #f1fa8c;">'7'</span>]
<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Xeg4</span> = Traversable.Array.traverse&lt;<span style="color: #f1fa8c;">'Xstream'</span>, <span style="color: #f8f8f2;">string</span>, <span style="color: #f8f8f2;">string</span>&gt;(<span style="color: #f1fa8c;">'Xstream'</span>)(
    (defaultVal, index) =&gt; (Xstream.fromEvent(<span style="color: #f1fa8c;">'change'</span>, <span style="color: #f1fa8c;">'traverse'</span> + index, defaultVal)),
    list
).toFantasyX()
    .map(xs =&gt; xs.map(strToInt))
    .map(sum)

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">ViewEg4</span> = props =&gt; &lt;section&gt;
{list.map((item, index) =&gt; (&lt;p&gt;
&lt;input key={index} type=<span style="color: #f1fa8c;">"number"</span> name={<span style="color: #f1fa8c;">"traverse"</span> + index} onChange={props.actions.fromEvent} defaultValue={item} /&gt;
&lt;/p&gt;))
}
  &lt;p&gt;&lt;span className=<span style="color: #f1fa8c;">"result"</span>&gt;{props.sum}&lt;/span&gt;&lt;/p&gt;
&lt;/section&gt;

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Eg4</span> = Xeg4.map(a=&gt;({sum: a})).apply(ViewEg4)
</pre>
</div>

<p><div id="eg4"></div></p>
</div>
</div>


<div id="outline-container-org9aada60" class="outline-2">
<h2 id="org9aada60"><span class="section-number-2">6</span> Example 5: Asynchronous</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-js">  <span style="color: #ff79c6; font-weight: bold;">function</span> <span style="color: #50fa7b; font-weight: bold;">bmiCalc</span>(<span style="color: #f8f8f2;">weight</span>, <span style="color: #f8f8f2;">height</span>) {
    <span style="color: #ff79c6; font-weight: bold;">return</span> fetch(<span style="color: #f1fa8c;">`https://gist.github.com.ru/jcouyang/edc3d175769e893b39e6c5be12a8526f?height=${height}&amp;weight=${weight}`</span>)
        .then(resp =&gt; resp.json())
        .then(json =&gt; json.result)
  }

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">xweigth</span> =     Xstream.fromEvent(<span style="color: #f1fa8c;">'change'</span>, <span style="color: #f1fa8c;">'weight'</span>, <span style="color: #f1fa8c;">'70'</span>)
<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">xheight</span> =    Xstream.fromEvent(<span style="color: #f1fa8c;">'change'</span>, <span style="color: #f1fa8c;">'height'</span>, <span style="color: #f1fa8c;">'175'</span>)

  <span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">promiseXstream</span> = lift2&lt;<span style="color: #f1fa8c;">"Xstream"</span>, <span style="color: #f8f8f2;">string</span>, <span style="color: #f8f8f2;">string</span>, <span style="color: #f8f8f2;">Promise</span>&lt;any&gt;&gt;(bmiCalc)(
xweigth,
xheight
  )

<span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Xeg5</span> = FlatMap.Xstream.flatMap(Xstream.fromPromise, promiseXstream)
.toFantasyX()

   <span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">ViewEg5</span> = props =&gt; (
     &lt;div&gt;
       &lt;label&gt;Height: {props.height} cm
         &lt;input type=<span style="color: #f1fa8c;">"range"</span> name=<span style="color: #f1fa8c;">"height"</span> onChange={props.actions.fromEvent} min=<span style="color: #f1fa8c;">"150"</span> max=<span style="color: #f1fa8c;">"200"</span> defaultValue={props.height} /&gt;
       &lt;/label&gt;
       &lt;label&gt;Weight: {props.weight} kg
         &lt;input type=<span style="color: #f1fa8c;">"range"</span> name=<span style="color: #f1fa8c;">"weight"</span> onChange={props.actions.fromEvent} min=<span style="color: #f1fa8c;">"40"</span> max=<span style="color: #f1fa8c;">"100"</span> defaultValue={props.weight} /&gt;
       &lt;/label&gt;
       &lt;p&gt;HEALTH: &lt;span&gt;{props.health}&lt;/span&gt;&lt;/p&gt;
       &lt;p&gt;BMI: &lt;span className=<span style="color: #f1fa8c;">"result"</span>&gt;{props.bmi}&lt;/span&gt;&lt;/p&gt;
     &lt;/div&gt;
   )

   <span style="color: #ff79c6; font-weight: bold;">let</span> <span style="color: #f8f8f2;">Eg5</span> = Xeg5.apply(ViewEg5)
</pre>
</div>

<p><div id="eg5"></div></p>



<script src="example.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-09-09 Sat 00:00</p>
<p class="author">Author: Jichao Ouyang</p>
<p class="date">Created: 2017-10-19 Thu 16:19</p>
<p class="validation"></p>
</div>
</body>
</html>
